tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/nix/store/yl7q0gjanvqhq33pbwnx10dq8jkr9l5q-tsung-1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="60000"/>
  </clients>

  <servers>
    <server host="localhost" port="3001" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users maxnumber="800" arrivalrate="100" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session name="ask-question" probability="50" type="ts_http">
      <request>
        <dyn_variable name="authenticity_token" />
        <http url="/users/sign_in" method="GET" version="1.1" />
      </request>
      <setdynvars sourcetype="eval"
                  code="fun({Pid,DynVars})->
                            {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                            http_uri:encode(Val) end.">
        <var name="encoded_authenticity_token" />
      </setdynvars>
      <request subst="true">
        <http url="/users/sign_in" method="POST" version="1.1"
          content_type='application/x-www-form-urlencoded'
          contents='authenticity_token=%%_encoded_authenticity_token%%&amp;user[username]=cs2500student&amp;user[password]=cs2500student'
        />
      </request>
      <request>
        <http url="/graphql" method="POST" version="1.1"
          content_type='application/json'
          contents='{"query":"mutation AskQuestionMutation(\n  $input: AskQuestionInput!\n) {\n  askQuestion(input: $input) {\n    question {\n      ...AskQuestion_single\n      id\n    }\n    questionEdge {\n      node {\n        id\n      }\n    }\n  }\n}\n\nfragment AskQuestion_single on Question {\n  createdAt\n  body\n}\n","variables":{"input":{"registrationId":"UmVnaXN0cmF0aW9uLTE=","body":"pls help"}}}'
        >
          <http_header name="X-CSRF-Token" value="%%_encoded_authenticity_token%%"/>
        </http>
      </request>
    </session>
    <session name="subscribe-announcements" probability="50" type="ts_websocket">
      <request>
        <websocket type="connect" path="/cable"/>
      </request>

      <thinktime min="10" max="20" random="true" />

      <request subst="true">
        <websocket type="message" frame="text">
          {"command":"subscribe","identifier":"{\"channel\":\"GraphqlChannel\"}"}
        </websocket>
      </request>

      <thinktime value="10" />

      <for var="i" from="1" to="400" incr="1">
        <thinktime min="1" max="4" random="true"/>
        <request subst="true">
          <websocket type="message" frame="text">
            {"command":"message","data":"{\"variables\":{\"roomId\":\"Um9vbS0x\"},\"operationName\":\"ExamMessagesNewRoomAnnouncementSubscription\",\"query\":\"subscription ExamMessagesNewRoomAnnouncementSubscription( $roomId: ID!) { roomAnnouncementReceived(roomId: $roomId) { roomAnnouncement { id createdAt body } roomAnnouncementsEdge { node { id } } } } \",\"action\":\"execute\"}","identifier":"{\"channel\":\"GraphqlChannel\"}"}
          </websocket>
        </request>
      </for>
    </session>
  </sessions>
</tsung>