tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/nix/store/yl7q0gjanvqhq33pbwnx10dq8jkr9l5q-tsung-1.7.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="debug" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="60000"/>
  </clients>

  <servers>
    <server host="localhost" port="3001" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users maxnumber="800" arrivalrate="100" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/cable"/>
      </request>

      <thinktime min="10" max="20" random="true" />

      <request subst="true">
        <websocket type="message" frame="text">
          {"command":"subscribe","identifier":"{\"channel\":\"GraphqlChannel\"}"}
        </websocket>
      </request>

      <thinktime value="10" />

      <for var="i" from="1" to="400" incr="1">
        <thinktime min="1" max="4" random="true"/>
        <request subst="true">
          <websocket type="message" frame="text">
            {"command":"message","data":"{\"variables\":{\"roomId\":\"Um9vbS0x\"},\"operationName\":\"ExamMessagesNewRoomAnnouncementSubscription\",\"query\":\"subscription ExamMessagesNewRoomAnnouncementSubscription( $roomId: ID!) { roomAnnouncementReceived(roomId: $roomId) { roomAnnouncement { id createdAt body } roomAnnouncementsEdge { node { id } } } } \",\"action\":\"execute\"}","identifier":"{\"channel\":\"GraphqlChannel\"}"}
          </websocket>
        </request>
      </for>
    </session>
  </sessions>
</tsung>